Repository: BravoBaldo/Translations
Catalog: Yocto/Official/Yocto_OmegaT/Yocto_OmegaT-level2.tmx
Source language: en_us
Languages: it_it

source: If your Linux distribution is not in the above list, we recommend to get the :term:`buildtools` or :term:`buildtools-extended` tarballs containing the host tools required by your Yocto Project release, typically by running ``scripts/install-buildtools`` as explained in the ":ref:`system-requirements-buildtools`" section.
it_it: Se la propria distribuzione Linux non è presente nell'elenco, consigliamo di scaricare i tarball :term:`buildtools` o :term:`buildtools-extended` contenenti gli strumenti host richiesti dalla release di Yocto Project, in genere eseguendo ``scripts/install-buildtools`` come spiegato nella sezione ":ref:`system-requirements-buildtools`".

source: If your Toaster database had only one build, the above :ref:`toaster-manual/reference:``buildslist``` command would return something like the following::
it_it: Se il database di Toaster contenesse una sola build, il comando :ref:`toaster-manual/reference:``buildslist``` restituirebbe un output simile al seguente::

source: If your build host does not satisfy all of the above version requirements, you can take steps to prepare the system so that you can still use the Yocto Project. See the :ref:`ref-manual/system-requirements:required git, tar, python, make and gcc versions` section in the Yocto Project Reference Manual for information.
it_it: Se l'host di compilazione non soddisfa tutti i requisiti di versione sopra indicati, si possono adottare delle misure per preparare il sistema in modo da poter comunque utilizzare lo Yocto Project. Consultare la sezione :ref:`ref-manual/system-requirements:required git, tar, python, make and gcc versions` nel Manuale di Riferimento di Yocto Project per ulteriori informazioni.

source: If your build system has the ``oss4-dev`` package installed, you might experience QEMU build failures due to the package installing its own custom ``/usr/include/linux/soundcard.h`` on the Debian system. If you run into this situation, try either of these solutions::
it_it: Se il sistema di build ha installato il pacchetto ``oss4-dev``, si potrebbero riscontrare errori di compilazione di QEMU a causa dell'installazione, da parte del pacchetto, di una propria versione personalizzata di ``/usr/include/linux/soundcard.h`` sul sistema Debian. Se ci si imbatte in questa situazione, provare una di queste soluzioni::

source: If your development host is going to be a system that runs a Linux distribution, you must still take steps to prepare the system for use with the Yocto Project. You need to be sure that the Linux distribution on the system is one that supports the Yocto Project. You also need to be sure that the correct set of host packages are installed that allow development using the Yocto Project. For the steps needed to set up a development host that runs Linux, see the ":ref:`dev-manual/start:setting up a native linux host`" section in the Yocto Project Development Tasks Manual.
it_it: Se l'host di sviluppo è un sistema che esegue una distribuzione Linux, è comunque necessario prepararlo per l'utilizzo con Yocto Project. Bisogna assicurarsi che la distribuzione Linux installata sul sistema supporti Yocto Project e che siano installati i pacchetti host necessari per lo sviluppo con Yocto Project. Per i passaggi necessari alla configurazione di un host di sviluppo Linux, consultare la sezione ":ref:`dev-manual/start:setting up a native linux host`" nel Manuale di Sviluppo dei Task di Yocto Project.

source: If your host development system does not meet all these requirements, you can resolve this by installing a :term:`buildtools` tarball that contains these tools. You can either download a pre-built tarball or use BitBake to build one.
it_it: Se il sistema host di sviluppo non soddisfa tutti questi requisiti, è possibile risolvere il problema installando un file tarball :term:`buildtools` contenente questi strumenti. È possibile scaricare un file tarball precompilato oppure utilizzare BitBake per crearne uno.

source: If your host development system does not meet this requirement, you can resolve this by installing a :term:`buildtools-extended` tarball that contains additional tools, the equivalent of the Debian/Ubuntu ``build-essential`` package.
it_it: Se il sistema host di sviluppo non soddisfa questo requisito, è possibile risolvere il problema installando un tarball :term:`buildtools-extended` che contiene strumenti aggiuntivi, l'equivalente del pacchetto ``build-essential`` di Debian/Ubuntu.

source: If your host development system needs the additional tools provided in the :term:`buildtools-extended` tarball, you can instead execute the ``install-buildtools`` script with the default parameters::
it_it: Se il sistema host di sviluppo necessita degli strumenti aggiuntivi forniti nel file tarball :term:`buildtools-extended`, è possibile eseguire lo script ``install-buildtools`` con i parametri di default::

source: If your patches have not had any feedback in a few days, they may have already been merged. You can run ``git pull`` branch to check this. Note that many if not most layer maintainers do not send out acknowledgement emails when they accept patches. Alternatively, if there is no response or merge after a few days the patch may have been missed or the appropriate reviewers may not currently be around. It is then perfectly fine to reply to it yourself with a reminder asking for feedback.
it_it: Se le patch non hanno ricevuto alcun feedback per alcuni giorni, potrebbero essere già state integrate. Si può eseguire ``git pull`` branch per verificarlo. Da tener presente che molti, se non la maggior parte, dei manutentori dei layer non inviano email di conferma quando accettano una patch. In alternativa, se non c'è risposta o integrazione dopo alcuni giorni, la patch potrebbe essere stata trascurata o i revisori appropriati potrebbero non essere disponibili al momento. È quindi perfettamente lecito rispondere personalmente con un promemoria per richiedere un feedback.

source: If your target architecture is supported by the Yocto Project, you can take advantage of pre-built images that ship with the Yocto Project and already contain cross-development toolchain installers.
it_it: Se l'architettura target è supportata da Yocto Project, è possibile utilizzare le immagini precompilate fornite con Yocto Project, che contengono già i programmi di installazione della toolchain di cross-sviluppo.

source: Image Generation
it_it: Generazione dell'Immagine

source: Images
it_it: Immagini

source: Implement and commit changes
it_it: Implementare e confermare le modifiche

source: Implementation details
it_it: Dettagli di implementazione

source: Import your own layers for building.
it_it: Importare i propri layer per la compilazione.

source: In :term:`OpenEmbedded-Core (OE-Core)`, the list of available :term:`Built-in Fragments <Built-in Fragment>` can be obtained from the :term:`OE_FRAGMENTS_BUILTIN` variable.
it_it: In :term:`OpenEmbedded-Core (OE-Core)`, l'elenco dei :term:`Built-in Fragments <Built-in Fragment>` disponibili può essere ottenuto dalla variabile :term:`OE_FRAGMENTS_BUILTIN`.

source: In :term:`OpenEmbedded-Core (OE-Core)`, the location of fragments and what variables are required in a fragment is specified in :oe_git:`bitbake.conf </openembedded-core/tree/meta/conf/bitbake.conf>` thanks to the :ref:`addfragments <bitbake-user-manual/bitbake-user-manual-metadata:\`\`addfragments\`\` directive>` directive and the :term:`OE_FRAGMENTS`, :term:`OE_FRAGMENTS_METADATA_VARS` and :term:`OE_FRAGMENTS_BUILTIN` variables.
it_it: In :term:`OpenEmbedded-Core (OE-Core)`, la posizione dei frammenti e le variabili necessarie per ciascun frammento sono specificate nel file :oe_git:`bitbake.conf </openembedded-core/tree/meta/conf/bitbake.conf>` grazie alla direttiva :ref:`addfragments <bitbake-user-manual/bitbake-user-manual-metadata:\`\`addfragments\`\` directive>` e alle variabili :term:`OE_FRAGMENTS`, :term:`OE_FRAGMENTS_METADATA_VARS` e :term:`OE_FRAGMENTS_BUILTIN`.

source: In addition to BSP layers, the ``meta-yocto-bsp`` layer is part of :yocto_git:`meta-yocto </meta-yocto>`. The ``meta-yocto-bsp`` layer maintains several "reference" BSPs including the ARM-based Beaglebone and generic versions of both 32-bit and 64-bit IA machines.
it_it: Oltre ai layer BSP, il layer ``meta-yocto-bsp`` fa parte di :yocto_git:`meta-yocto </meta-yocto>`. Il layer ``meta-yocto-bsp`` gestisce diversi BSP di riferimento, tra cui il Beaglebone basato su ARM e versioni generiche di macchine IA a 32 e 64 bit.

source: In addition to the previous packages, here are the packages needed to build the documentation in PDF format:
it_it: Oltre ai pacchetti precedenti, ecco quelli necessari per creare la documentazione in formato PDF:

source: In addition to the previous packages, the following TeX Live packages are needed to build the documentation in PDF format and can be installed with the `TeX Live package manager <https://tug.org/texlive/tlmgr.html>`__:
it_it: Oltre ai pacchetti precedenti, per creare la documentazione in formato PDF sono necessari i seguenti pacchetti TeX Live, installabili tramite il `gestore di pacchetti TeX Live <https://tug.org/texlive/tlmgr.html>`__:

source: In addition to the web user interface and the scripts that start and stop Toaster, command-line commands are available through the ``manage.py`` management script. You can find general documentation on ``manage.py`` at the `Django <https://docs.djangoproject.com/en/2.2/topics/settings/>`__ site. However, several ``manage.py`` commands have been created that are specific to Toaster and are used to control configuration and back-end tasks. You can locate these commands in the :term:`Source Directory` (e.g. ``poky``) at ``bitbake/lib/manage.py``. This section documents those commands.
it_it: Oltre all'interfaccia utente web e agli script che avviano e arrestano Toaster, sono disponibili comandi da riga di comando tramite lo script di gestione ``manage.py``. È possibile trovare la documentazione generale su ``manage.py`` sul sito di `Django <https://docs.djangoproject.com/en/2.2/topics/settings/>`__. Tuttavia, sono stati creati diversi comandi ``manage.py`` specifici per Toaster, utilizzati per controllare la configurazione e le attività di back-end. È possibile trovare questi comandi nella :term:`Source Directory` (ad esempio ``poky``) in ``bitbake/lib/manage.py``. Questa sezione documenta tali comandi.

source: In addition, your host development system must meet the following version requirement for gcc:
it_it: Inoltre, il sistema host di sviluppo deve soddisfare il seguente requisito di versione per gcc:

source: In another shell, execute a workload you want to trace::
it_it: In un'altra shell, eseguire il carico di lavoro che si desidera tracciare::

source: In another window, run the ``wget`` test::
it_it: In un'altra finestra, eseguire il test ``wget``::

source: In any case, never fix reported issues by fixing them in new commits on the tip of your branch. Always come up with a new series of commits without the reported issues.
it_it: In ogni caso, non correggere mai i problemi segnalati modificandoli in nuovi commit sul proprio branch. Creare sempre una nuova serie di commit senza i problemi segnalati.

source: In case you are sending patches for :oe_git:`meta-openembedded </meta-openembedded/>` or any layer other than :oe_git:`openembedded-core </openembedded-core/>`, please add the appropriate prefix so that it is clear which layer the patch is intended to be applied to::
it_it: Nel caso in cui si stia inviando patch per :oe_git:`meta-openembedded </meta-openembedded/>` o per qualsiasi altro layer diverso da :oe_git:`openembedded-core </openembedded-core/>`, aggiungere il prefisso appropriato in modo che sia chiaro a quale layer deve essere applicata la patch::

source: In cases where ``sstate-inputdirs`` and ``sstate-outputdirs`` would be the same, you can use ``sstate-plaindirs``. For example, to preserve the ${:term:`PKGD`} and ${:term:`PKGDEST`} output from the :ref:`ref-tasks-package` task, use the following::
it_it: Nei casi in cui ``sstate-inputdirs`` e ``sstate-outputdirs`` coincidano, è possibile utilizzare ``sstate-plaindirs``. Ad esempio, per preservare l'output ${:term:`PKGD`} e ${:term:`PKGDEST`} dal task :ref:`ref-tasks-package`, utilizzare quanto segue::

source: In each branch, you should group your changes into small, controlled and isolated ones. Keeping changes small and isolated aids review, makes merging/rebasing easier and keeps the change history clean should anyone need to refer to it in future.
it_it: In ogni branch, si deve raggruppare le proprie modifiche in piccole parti controllate e isolate. Mantenere le modifiche piccole e isolate facilita la revisione, semplificare le operazioni di merge/rebase e mantenere pulita la cronologia delle modifiche, qualora qualcuno dovesse farvi riferimento in futuro.

source: In either case, the phrase "container layer" is simply used to describe a directory structure which contains multiple valid OpenEmbedded layers.
it_it: In entrambi i casi, l'espressione "container layer" viene semplicemente utilizzata per descrivere una struttura di directory che contiene più layer OpenEmbedded validi.

source: In either case, the result will be a set of :term:`Layers <Layer>` and a :term:`Build Directory`: this is the Source Directory for your build. The documentation usually denotes this directory with the name "bitbake-builds".
it_it: In entrambi i casi, il risultato sarà un insieme di :term:`Layers <Layer>` e una :term:`Build Directory`: questa è la directory sorgente per la build. La documentazione di solito indica questa directory con il nome "bitbake-builds".

source: In general, a "layer source" is a source of information about existing layers. In particular, we are concerned with layers that you can use with the Yocto Project and Toaster. This chapter describes a particular type of layer source called a "layer index."
it_it: In generale, una "sorgente di layer" è una fonte di informazioni sui layer esistenti. In particolare, ci occupiamo dei layer utilizzabili con Yocto Project e Toaster. Questo capitolo descrive un tipo specifico di sorgente di layer, chiamato "layer index" [indice di layer].

source: In general, a cross-development toolchain is a collection of software development tools and utilities that run on one architecture and allow you to develop software for a different, or targeted, architecture. These toolchains contain cross-compilers, linkers, and debuggers that are specific to the target architecture.
it_it: In generale, una toolchain di cross-sviluppo è una raccolta di strumenti e utilità di sviluppo software che vengono eseguiti su un'architettura e consentono di sviluppare software per un'architettura diversa, o di destinazione [target]. Queste toolchain contengono cross-compilatori, linker e debugger specifici per l'architettura target.

source: In general, all layers have a similar structure. They all contain a licensing file (e.g. ``COPYING.MIT``) if the layer is to be distributed, a ``README`` file as good practice and especially if the layer is to be distributed, a configuration directory, and recipe directories. You can learn about the general structure for layers used with the Yocto Project in the ":ref:`dev-manual/layers:creating your own layer`" section in the Yocto Project Development Tasks Manual. For a general discussion on layers and the many layers from which you can draw, see the ":ref:`overview-manual/concepts:layers`" and ":ref:`overview-manual/yp-intro:the yocto project layer model`" sections both earlier in this manual.
it_it: In generale, tutti i layer hanno una struttura simile. Contengono tutti un file di licenza (ad esempio, ``COPYING.MIT``) se il layer deve essere distribuito, un file ``README`` come buona prassi e soprattutto se il layer deve essere distribuito, una directory di configurazione e directory di ricette. È possibile trovare informazioni sulla struttura generale dei layer utilizzati con Yocto Project nella sezione ":ref:`dev-manual/layers:creating your own layer`" nel Manuale di Sviluppo dei Task di Yocto Project. Per una discussione generale sui layer e sui numerosi layer da cui è possibile attingere, consultare le sezioni ":ref:`overview-manual/concepts:layers`" e ":ref:`overview-manual/yp-intro:the yocto project layer model`" presenti in precedenza in questo manuale.

source: In general, each component (e.g. layer) should have a ``README`` file that indicates where to send the changes and which process to follow.
it_it: In generale, ogni componente (ad esempio, un layer) dovrebbe avere un file ``README`` che indica dove inviare le modifiche e quale procedura seguire.

source: In general, layers are repositories that contain related sets of instructions and configurations that tell the Yocto Project what to do. Isolating related metadata into functionally-specific layers facilitates modular development and makes it easier to reuse the layer metadata.
it_it: In generale, i layer sono repository che contengono set correlati di istruzioni e configurazioni che indicano allo Yocto Project cosa fare. Isolare i metadati correlati in layer specifici per funzionalità facilita lo sviluppo modulare e semplifica il riutilizzo dei metadati del layer.

source: In general, most recipes should follow the naming convention ``recipes-category/recipename/recipename_version.bb``. Recipes for related projects may share the same recipe directory. ``recipename`` and ``category`` may contain hyphens, but hyphens are not allowed in ``version``.
it_it: In generale, la maggior parte delle ricette dovrebbe seguire la convenzione di denominazione ``recipes-category/recipename/recipename_version.bb``. Le ricette per progetti correlati possono condividere la stessa directory. ``recipename`` e ``category`` possono contenere trattini, ma i trattini non sono consentiti in ``version``.

source: In general, the Yocto Project is broadly licensed under the Massachusetts Institute of Technology (MIT) License. MIT licensing permits the reuse of software within proprietary software as long as the license is distributed with that software. Patches to the Yocto Project follow the upstream licensing scheme. You can find information on the MIT license :wikipedia:`here <MIT_License>`.
it_it: In generale, Yocto Project è ampiamente distribuito con la licenza del Massachusetts Institute of Technology (MIT). La licenza MIT consente il riutilizzo del software all'interno di software proprietario, a condizione che la licenza sia distribuita insieme al software stesso. Le patch per Yocto Project seguono lo schema di licenza upstream. Si possono trovare informazioni sulla licenza MIT :wikipedia:`qui <MIT_License>`.

source: In general, the build's workflow consists of several functional areas:
it_it: In generale, il flusso di lavoro di una build è composto da diverse aree funzionali:

source: In general, there are three types of layer input. You can see them below the "User Configuration" box in the :ref:`general workflow figure <overview-manual/concepts:openembedded build system concepts>`:
it_it: In generale, esistono tre tipi di input per i layer. È possibile visualizzarli sotto la casella "User Configuration" nella figura del :ref:`figura del flusso di lavoro generale <overview-manual/concepts:openembedded build system concepts>`:

source: In its description, each patch should provide detailed information about the bug that it addresses, such as the URL in a bug tracking system and links to relevant mailing list archives.
it_it: Nella sua descrizione, ogni patch dovrebbe fornire informazioni dettagliate sul bug che risolve, come l'URL in un sistema di tracciamento dei bug e i link agli archivi delle mailing list pertinenti.

source: In many ways, perf aims to be a superset of all the tracing and profiling tools available in Linux today, including all the other tools covered in this How-to. The past couple of years have seen perf subsume a lot of the functionality of those other tools and, at the same time, those other tools have removed large portions of their previous functionality and replaced it with calls to the equivalent functionality now implemented by the perf subsystem. Extrapolation suggests that at some point those other tools will become completely redundant and go away; until then, we'll cover those other tools in these pages and in many cases show how the same things can be accomplished in perf and the other tools when it seems useful to do so.
it_it: Per molti aspetti, perf si propone di essere un superset di tutti i tool di tracciamento e profilazione attualmente disponibili in Linux, inclusi tutti gli altri strumenti descritti in questa guida. Negli ultimi due anni, perf ha integrato gran parte delle funzionalità di questi altri strumenti e, allo stesso tempo, questi ultimi hanno rimosso ampie porzioni delle loro funzionalità precedenti, sostituendole con chiamate alle funzionalità equivalenti ora implementate dal sottosistema perf. È probabile che a un certo punto questi altri strumenti diventeranno completamente obsoleti e scompariranno. Fino ad allora, tratteremo questi altri strumenti in queste pagine e, in molti casi, mostreremo come ottenere gli stessi risultati con perf e gli altri tool quando ciò si rivela utile.

source: In many ways, profiling can be viewed as a subset of tracing --- theoretically, if you have a set of trace events that's sufficient to capture all the important aspects of a workload, you can derive any of the results or views that a profiling run can.
it_it: Per molti aspetti, la profilazione può essere considerata un sottoinsieme del tracing: teoricamente, se si dispone di un insieme di eventi di tracing sufficiente a catturare tutti gli aspetti importanti di un carico di lavoro, è possibile ricavare qualsiasi risultato o visualizzazione ottenibile con un'esecuzione di profilazione.

source: In most cases the version :term:`PV` will be set automatically from the recipe file name. It is recommended to use released versions of software as these are revisions that upstream are expecting people to use.
it_it: Nella maggior parte dei casi, la versione :term:`PV` verrà impostata automaticamente dal nome del file della ricetta. Si consiglia di utilizzare le versioni rilasciate del software, poiché si tratta delle revisioni che gli sviluppatori si aspettano vengano utilizzate.

source: In one of our previous releases (denzil), users noticed that booting off of a live image and writing to disk was noticeably slower. This included the boot itself, especially the first one, since first boots tend to do a significant amount of writing due to certain post-install scripts.
it_it: In una delle nostre precedenti versioni (denzil), gli utenti hanno notato che il boot da un'immagine live e la scrittura su disco erano notevolmente più lenti. Questo includeva il boot stesso, soprattutto il primo, poiché i primi boot tendono a eseguire una quantità significativa di operazioni di scrittura a causa di alcuni script post-installazione.

source: In order for a BSP layer to be considered compliant with the Yocto Project, it must meet some structural requirements.
it_it: Affinché un layer BSP sia considerato conforme allo Yocto Project, deve soddisfare alcuni requisiti strutturali.
